<?php

use Illuminate\Database\Seeder;

class PostsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->delete();

        $posts = array(
            ['id' => 1, 'title' => 'Samsung Galaxy S10 и Note10: Телефони коишто ја одбележаа 2019 година', 'intro' => 'Домашната јавност во Македонија отсекогаш покажувала огромен интерес за Samsung уредите. Продажбата на Galaxy S10 достигна рекордно ниво на заинтересираност и продажба помеѓу македонците', 'slug'=> 'Samsung-Galaxy-S10-2019',
                'body' => 'Скопје, 21. јануари 2020 – Во растечката индустрија на паметни телефони, секој месец излегуваат нови модели, меѓутоа само најквалитетните успеваат да привлечат внимание и да ја заслужат довербата на корисниците со своите перформанси. Сериите уреди Samsung Galaxy S10 и Galaxy Note10 се точно такви модели, кои што во текот на минатата година се истакнаа со врвен квалитет во полето на софтверот, хардверот и дизајнот.
Визуелно впечатливиот Quad HD+ AMOLED Infinity-O екран на Galaxy S10+ моделот, му обезбеди на овој телефон сигурно место на многубројните топ листи на најдобри паметни телефони за 2019 година, додека DisplayMate, компанија која што работи со тестирање на телефони, го оцени Galaxy S10 со највисока А+ оцена. Во независната анализа за најдобри паметни телефони што ја спроведе британското здружение на потрошувачи Which? Galaxy S10 5G го зазема првото место, додека после него се позиционираа Galaxy Note10+ 5G и Galaxy S10+, како единствени модели оценети повеќе од 90 проценти. Исто така, сите уреди од Galaxy S10 и Note10 сериите се означени со титулата Best buy која ова здружение ја доделува за одличен квалитет и врвни перформанси во склад со цената.
И за Galaxy Note10+ минатата година беше исклучително добра. Камерата од професионален ранг која што им овозможува на корисниците да снимаат видео содржини и фотографии како никогаш досега, дефинитивно ги остави без здив сите кои што ја пробаа. Од страна на престижниот, светски признат сајт за тестирање на паметни телефони DxO Mark, Galaxy Note10+ 5G е прогласен за телефон со најдобра предна камера, како и со најдобра ултра широка камера. Во компаративниот тест за четири најпопуларни модели на паметни телефони, овој новитет ја зема титулата за најдобра камера во ултра широка категорија. DisplayMate на моделот Note10+ 5G му ја додели и наградата за Најдобар екран на паметен телефон. Корисниците, медиумите и стручната јавност се сложија дека функционалноста и бескрајните можности кои Note10 сериите ги пружаат со својата камера, S пенкалото, одличниот дисплеј и корисните апликации, оваа серија на телефони ја прават беспрекорна.
Домашната јавност во Македонија отсекогаш покажувала огромен интерес за Samsung уредите. Продажбата на Galaxy S10 достигна рекордно ниво на заинтересираност и продажба помеѓу македонците. Според анкетата на веб порталот telefoni.mk, читателите за најдобар смартфон на годината го избраа врвниот премиум смартфон Samsung Galaxy S10 Plus. Овој знаменосец на Samsung, во анкетата во која учествуваа над 1.000 испитаници, има освоено 30% од гласовите односно над 300 поединечни гласови во споредба со останатите смартфони кои беа во трката за најдобар смартфон според македонските фанови. Според анкетата, вториот кандидат на Samsung во годинешната трка на telefoni.mk, Samsung Galaxy Note10 Plus го има освоено петтото место со 9% добиени гласови.',
                'cover_img' => 'Note10.jpg', 'created_at' => new DateTime(), 'updated_at' => new DateTime()],
            ['id' => 2, 'title' => 'Google во соработка со истражувачи успеаја да направат мапирање на поврзаноста во мозок со досега најголема резолуција', 'intro'=>'Мапирањето е направено на само еден дел од мозокот на мува, но ова сепак се смета за голем успех', 'slug'=> 'Google-Brain-Mapping',
                'body' => 'Истражувачи од Google во соработка со за нас не толку познатиот Janelia Research Campus од американската сојузна држава Вирџинија, објавија дека успеале да направат мапирање на мозокот, односно на поврзаноста во него, со досега најголема резолуција која е успеано да се направи.
Причината поради која ова се смета за успех може да се види кога ќе се разгледаат бројките. Мапирањето е направено на околу четвртина од мозокот на мува, што значи дека се работи за толку сложен процес, што дури и тој помал мозок не се успева целосно да се мапира.
За споредба, мозокот на мувата има околу 100.000 неврони, додека човековиот мозок има повеќе од 80 милијарди.
Ова покажува дека мозокот генерално уште е нешто што науката има време додека успее целосно да го „дешифрира“ да го употребиме тој термин.
Мапирањето на мозокот се смета дека е нешто што ќе овозможи многу подобро да се открие неговата работа, односно секој поединечен дел. Со тоа ќе може да се откријат повеќе проблеми на мозокот, во крајна цел секако да се користи во медицината.
Мапирањето на дел од мозокот на мувата е направено со сечење на делови од мозокот на парчиња кои се доста тенки, повеќе пати потенки од човековото влакно за споредба. Потоа, на овие делови се пуштани електрони од микроскоп, по што се добива резултатот кој можете да го видите на видеото во продолжение.',
                'cover_img' => 'Brain.jpg', 'created_at' => new DateTime(), 'updated_at' => new DateTime()],
            ['id' => 3, 'title' => 'Bloomberg најавува претставување на помал и поевтин iPhone во март',
                'intro'=>'Телефонот треба да почне да се произведува во февруари, а се очекува да има дизајн скоро ист како iPhone 8', 'slug'=>'bloomberg-new-iphone',
                'body' => 'Apple обично претставува нови телефони во есен, а оваа година може да се каже и дека посебно ги исчекуваме овие модели, кои се надеваме дека ќе имаат нешто поразличен дизајн, а посебно дека ќе го тргнат исечокот од горната страна на екранот или барем да го намалат.
Сепак, за оваа година веќе неколку пати можевме да прочитаме дека Apple планира и дополнителен модел којшто може да биде претставен порано од другите, модел кој треба да е и поевтин.
Таков модел порано беше iPhone SE, па најавите се дека Apple ќе ја претстави втората верзија од овој телефон.
Bloomberg излезе со информации од свои извори, кои наводно се запознаени со случувањата, дека Apple веќе има нарачано да се започне со производството на овој уред и тоа треба да почне идниот месец, односно во февруари.
Претставувањето на телефонот, според овие информации, треба да се очекува во март.
Какво и да биде името на овој уред, тоа што се најавува веќе неколку пати, а и сега од страна на Bloomberg, е дека дизајнот на овој уред ќе биде како на последните телефони пред iPhone X, односно iPhone 8.
Тоа значи дека уредот ќе има стандардни рамки, ќе нема исечок на горната страна, а доле ќе биде достапно и старото Home копче, на кое ќе биде поставен сензорот за отпечатоци, односно овој уред ќе дојде со Touch ID и нема да има Face ID.
За разлика од претходниот поевтин iPhone, овој нема да има до толку мал екран, односно ќе има екран со големина од 4,7 инчи. Тоа за денешно време како и да е делува доста мало, па најверојатно сепак луѓето ќе се одлучуваат за овој телефон поради неговата цена.
Цената на претходниот ваков модел, односно на iPhone SE беше 399 долари, меѓутоа нема информации која би можела да биде цената на овој нов уред. Очекувањата се дека ќе биде нешто слична, ако не и иста.
Тоа што е добра вест за овој уред е што се најавува дека ќе дојде со моментално најновиот чип од Apple, A13, којшто се користи во iPhone 11 моделите. Тоа значи дека од телефонот, иако нешто поевтин, ќе може да се очекуваат одлични перформанси, а посебно кога ќе се земе во предвид оптимизацијата на iOS.',
                'cover_img' => 'iphone.jpg', 'created_at' => new DateTime(), 'updated_at' => new DateTime()],
        );

        DB::table('posts')->insert($posts);
    }
}
