@extends('layouts.app')

@section('content')
    <h1>За нас</h1>
    <p>BlogApp е оформен од ентузијасти за технологија, кои својот интерес и познавање сакаат да го пренесат на
        читателите во Македонија. Ние ги следиме новостите во светот на технологијата и го надградуваме своето познавање
        веќе подолг период. Технологијата станува сé покористена во обичниот живот, па интересот за познавање на истата,
        а посебно новостите кои што станаа дел од секојдневниот живот, станува сé поголем. Веќе нема човек што не
        користи некој од огромниот број на достапни паметни телефони, таблет компјутери… Зошто и не би ги користеле ?
        Тие нудат можности и функции, што не биле ни замисливи до пред 20 години. Бројот на уреди е голем и станува сé
        поголем, на нив има огромен број на апликации, страните со корисни сервиси на интернет мрежата е огромен. Затоа
        нашата цел е да ги поедноставиме, организираме и направиме достапни преголемиот број на информации кои што
        растат со сé поголемиот број на уреди и сервиси достапни на пазарот.</p>

    <p> На овој портал можете да прочитате сé што е поврзано со таканаречената “паметна“ технологија. Новости за
        мобилните телефони, таблети, десктоп и лаптоп компјутери, играчки конзоли, геџети, мислења и рецензии на истите,
        совети и трикови. Сервиси како социјалните мрежи, новостите поврзани со нив, совети, предлози и слично.</p>

    <p>Нашата цел е да информацијата која во денешно време е сé побарана, меѓутоа достапна во голем број, ја направиме
        лесно достапна за вас, публиката во Македонија. Се разбира вашите предлози и критики се секогаш добредојдени,
        како би можеле овој портал да го направиме што покорисен за вас, а името да биде навистина заслужено.</p>
@endsection
